{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"noc2011": {"name": "noc2011:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "500"}]}}, "title:0": {"name": "title:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "task:0": {"name": "task:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}, "outputs": {"soc2010_out": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "841"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/title_hidden/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/title_hidden/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/task_hidden/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/task_hidden/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/noc2011_hidden/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "500"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/noc2011_hidden/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/concatenate_6/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "841"}]}}}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "841"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "noc2011", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "500"}]}}}}, {"name": "task", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}, {"name": "title", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/noc2011_hidden/Relu", "op": "_FusedMatMul", "input": ["noc2011", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/noc2011_hidden/MatMul/ReadVariableOp", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/noc2011_hidden/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/task_hidden/Relu", "op": "_FusedMatMul", "input": ["task", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/task_hidden/MatMul/ReadVariableOp", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/task_hidden/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/title_hidden/Relu", "op": "_FusedMatMul", "input": ["title", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/title_hidden/MatMul/ReadVariableOp", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/title_hidden/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/concatenate_6/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/noic2011_soc2010_xw_july2023/title_hidden/Relu", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/task_hidden/Relu", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/noc2011_hidden/Relu", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/concatenate_6/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/noic2011_soc2010_xw_july2023/concatenate_6/concat", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/MatMul/ReadVariableOp", "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/title_hidden/MatMul/ReadVariableOp", "shape": [512, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/title_hidden/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/task_hidden/MatMul/ReadVariableOp", "shape": [512, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/task_hidden/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/noc2011_hidden/MatMul/ReadVariableOp", "shape": [500, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/noc2011_hidden/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/concatenate_6/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/MatMul/ReadVariableOp", "shape": [96, 841], "dtype": "float32"}, {"name": "StatefulPartitionedCall/noic2011_soc2010_xw_july2023/soc2010_out/BiasAdd/ReadVariableOp", "shape": [841], "dtype": "float32"}]}]}