{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"soc1980": {"name": "soc1980:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "680"}]}}, "task:0": {"name": "task:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "title:0": {"name": "title:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}, "outputs": {"soc2010_out": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "841"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/title_hidden/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/title_hidden/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/task_hidden/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/task_hidden/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc1980_hidden/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "680"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc1980_hidden/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/concatenate_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "841"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "841"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "soc1980", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "680"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "task", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "title", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc1980_hidden/Relu", "op": "_FusedMatMul", "input": ["soc1980", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc1980_hidden/MatMul/ReadVariableOp", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc1980_hidden/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/task_hidden/Relu", "op": "_FusedMatMul", "input": ["task", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/task_hidden/MatMul/ReadVariableOp", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/task_hidden/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/title_hidden/Relu", "op": "_FusedMatMul", "input": ["title", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/title_hidden/MatMul/ReadVariableOp", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/title_hidden/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/concatenate_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/soc1980_soc2010_xw_july2023/title_hidden/Relu", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/task_hidden/Relu", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc1980_hidden/Relu", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/concatenate_3/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/soc1980_soc2010_xw_july2023/concatenate_3/concat", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/MatMul/ReadVariableOp", "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/title_hidden/MatMul/ReadVariableOp", "shape": [512, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/title_hidden/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/task_hidden/MatMul/ReadVariableOp", "shape": [512, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/task_hidden/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc1980_hidden/MatMul/ReadVariableOp", "shape": [680, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc1980_hidden/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/concatenate_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/MatMul/ReadVariableOp", "shape": [96, 841], "dtype": "float32"}, {"name": "StatefulPartitionedCall/soc1980_soc2010_xw_july2023/soc2010_out/BiasAdd/ReadVariableOp", "shape": [841], "dtype": "float32"}]}]}